# -*- coding: utf-8 -*-
# require 'jcode'
# $KCODE='e'

STANDARD = [
	"",
	"",
	"",
	"",
	"",
	"",
	"",
	"",
	"",
	"9人 ：村村村村村狼狼占霊",
	"10人：村村村村村狼狼占霊狂",
	"11人：村村村村村狼狼占霊狂狩",
	"12人：村村村村村村狼狼占霊狂狩",
	"13人：村村村村村村村狼狼占霊狂狩",
	"14人：村村村村村村村村狼狼占霊狂狩",
	"15人：村村村村村村村村狼狼狼占霊狂狩",
	"16人：村村村村村村村狼狼狼占霊狂狩共共",
	"17人：村村村村村村村村狼狼狼占霊狂狩共共",
	"18人：村村村村村村村村村狼狼狼占霊狂狩共共",
	"19人：村村村村村村村村村村狼狼狼占霊狂狩共共",
	"20人：村村村村村村村村村村村狼狼狼占霊狂狩共共",
	"21人：村村村村村村村村村村村村狼狼狼占霊狂狩共共",
	"22人：村村村村村村村村村村村村村狼狼狼占霊狂狩共共",
	"23人：村村村村村村村村村村村村村村狼狼狼占霊狂狩共共",
	"24人：村村村村村村村村村村村村村村狼狼狼狼占霊狂狩共共",
	"25人：村村村村村村村村村村村村村村村狼狼狼狼占霊狂狩共共",
	"26人：村村村村村村村村村村村村村村村村狼狼狼狼占霊狂狩共共"
]

YOUMA = [
	"",
	"",
	"",
	"",
	"",
	"",
	"6人 ：村村村狼占妖",
	"7人 ：村村村村狼占妖",
	"8人 ：村村村村狼狼占妖",
	"9人 ：村村村村狼狼占霊妖",
	"10人：村村村村狼狼占霊狂妖",
	"11人：村村村村狼狼占霊狂狩妖",
	"12人：村村村村村狼狼占霊狂狩妖",
	"13人：村村村村村村狼狼占霊狂狩妖",
	"14人：村村村村村村村狼狼占霊狂狩妖",
	"15人：村村村村村村村狼狼狼占霊狂狩妖",
	"16人：村村村村村村狼狼狼占霊狂狩共共妖",
	"17人：村村村村村村村狼狼狼占霊狂狩共共妖",
	"18人：村村村村村村村村狼狼狼占霊狂狩共共妖",
	"19人：村村村村村村村村村狼狼狼占霊狂狩共共妖",
	"20人：村村村村村村村村村村狼狼狼占霊狂狩共共妖",
	"21人：村村村村村村村村村村村狼狼狼占霊狂狩共共妖",
	"22人：村村村村村村村村村村村村狼狼狼占霊狂狩共共妖",
	"23人：村村村村村村村村村村村村村狼狼狼占霊狂狩共共妖",
	"24人：村村村村村村村村村村村村村狼狼狼狼占霊狂狩共共妖",
	"25人：村村村村村村村村村村村村村村狼狼狼狼占霊狂狩共共妖",
	"26人：村村村村村村村村村村村村村村村狼狼狼狼占霊狂狩共共妖"
]

CUPID = [
	"",
	"",
	"",
	"",
	"",
	"",
	"6人 ：村村村狼占求",
	"7人 ：村村村村狼占求",
	"8人 ：村村村村狼狼占求",
	"9人 ：村村村村狼狼占霊求",
	"10人：村村村村狼狼占霊狂Ｑ",
	"11人：村村村村狼狼占霊狂狩Ｑ",
	"12人：村村村村村狼狼占霊狂狩Ｑ",
	"13人：村村村村村村狼狼占霊狂狩Ｑ",
	"14人：村村村村村村村狼狼占霊狂狩Ｑ",
	"15人：村村村村村村村狼狼狼占霊狂狩Ｑ",
	"16人：村村村村村村狼狼狼占霊狂狩共共Ｑ",
	"17人：村村村村村村村狼狼狼占霊狂狩共共Ｑ",
	"18人：村村村村村村村村狼狼狼占霊狂狩共共Ｑ",
	"19人：村村村村村村村村村狼狼狼占霊狂狩共共Ｑ",
	"20人：村村村村村村村村村村狼狼狼占霊狂狩共共Ｑ",
	"21人：村村村村村村村村村村村狼狼狼占霊狂狩共共Ｑ",
	"22人：村村村村村村村村村村村狼狼狼狼占霊狂狩共共Ｑ",
	"23人：村村村村村村村村村村村村狼狼狼狼占霊狂狩共共Ｑ",
	"24人：村村村村村村村村村村村村村狼狼狼狼占霊狂狩共共Ｑ"
]

CATTLE = [
	"",
	"",
	"",
	"",
	"4人 ：村狼占狂",
	"5人 ：村村狼占狂",
	"6人 ：村村村狼占狂",
	"7人 ：村村村村狼占狂",
	"8人 ：村村村村狼狼占狩",
	"9人 ：村村村村村狼狼占狩",
	"10人：村村村村狼狼占霊狂狩",
	"11人：村村村村村狼狼占霊狂狩",
	"12人：村村村村村村狼狼占霊狂狩",
	"13人：村村村村村村村狼狼占霊狂狩",
	"14人：村村村村村村村村狼狼占霊狂狩",
	"15人：村村村村村村村村村狼狼占霊狂狩",
	"16人：村村村村村村村狼狼狼占霊狂狩共共",
	"17人：村村村村村村村村狼狼狼占霊狂狩共共",
	"18人：村村村村村村村村村狼狼狼占霊狂狩共共",
	"19人：村村村村村村村村村村狼狼狼占霊狂狩共共",
	"20人：村村村村村村村村村村村狼狼狼占霊狂狩共共",
	"21人：村村村村村村村村村村村村狼狼狼占霊狂狩共共",
	"22人：村村村村村村村村村村村村村狼狼狼占霊狂狩共共"
]

RDM = '占狼'

class Composition
	attr_reader :name, :list, :min, :max

	def initialize(name, list, min, max)
		@name = name
		@list = list
		@min = min
		@max = max
	end

	def Composition.compositions
		@@compositions
	end

	def Composition.display(comp_i)
		s = ''
		comp = @@compositions[comp_i]
		for i in comp.min..comp.max do
			s += "#{comp.list[i]}<br>"
		end
		s
	end

	a = Array.new
	a.push(Composition.new('カスタム', nil, nil, nil)) # 0
	a.push(Composition.new('標準', STANDARD, 9, 26)) # 1
	a.push(Composition.new('妖魔', YOUMA, 6, 26)) # 2
	a.push(Composition.new('キューピッド', CUPID, 6, 24)) # 3
	a.push(Composition.new('牛村', CATTLE, 4, 22)) # 4
	a.push(Composition.new('投稿', nil, 4, 22)) # 5
	a.push(Composition.new('ワイドカスタム', nil, 4, 22)) # 6
  a.push(Composition.new('ランダム', RDM, 4, 99)) # 7
	@@compositions = a
end

class Skill
	attr_accessor :name, :default_num, :position, :sname

	def initialize(name, default_num, position, sname)
		@name = name
    	@default_num = default_num
		@position = position
		@sname = sname
	end

	def Skill.skills
		@@skills
	end

	def Skill.num_skill
		@@num_skill
	end

	a = Array.new
	a.push(Skill.new('村人', 3, '村人', '村')) # 0
	a.push(Skill.new('人狼', 2, '人狼', '狼')) # 1
	a.push(Skill.new('占い師', 1, '村人', '占')) # 2
	a.push(Skill.new('霊能者', 1, '村人', '霊')) # 3
	a.push(Skill.new('狂人', 1, '人狼', '狂')) # 4
	a.push(Skill.new('狩人', 0, '村人', '狩')) # 5
	a.push(Skill.new('共有者', 0, '村人', '共')) # 6
	a.push(Skill.new('妖魔', 0, '妖魔', '妖')) # 7
	a.push(Skill.new('Ｃ国狂人', 0, '人狼', 'Ｃ')) # 8
	a.push(Skill.new('狂信者', 0, '人狼', '信')) # 9
	a.push(Skill.new('聖痕者', 0, '村人', '聖')) # 10
	a.push(Skill.new('中身占い師', 0, '村人', '中')) # 11
	a.push(Skill.new('キューピッド', 0, '恋人', 'Ｑ')) # 12
	a.push(Skill.new('求愛者', 0, '恋人', '求')) # 13
	a.push(Skill.new('邪魔狂人', 0, '人狼', '邪')) # 14
	a.push(Skill.new('烙印者', 0, '村人', '烙')) # 15
	a.push(Skill.new('風来狩人', 0, '村人', '風')) # 16
  a.push(Skill.new('絶対者', 0, '村人', '絶')) # 17
  a.push(Skill.new('絶対人狼', 0, '人狼', 'Ｚ')) # 18
	@@skills = a
end

